#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.kubernetes.module.infinity-gauntlet.module.services.module.cert-manager.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_namespace.namespace: Refreshing state... [id=actions-runner-system]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211001182016688800000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211001182016688800000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211001182016686900000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211001195608725900000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211001195608728200000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211001195608757000000003]
module.github.github_repository.example: Refreshing state... [id=terraform-example]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration: Refreshing state... [id=actions-runner-system/controller-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.helm_release.github-actions-runner-controller: Refreshing state... [id=actions-runner-controller]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"]: Refreshing state...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "tftp-netboot-infinity-gauntlet-20211001182016688800000003"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-etcd-20211001182016688800000002"
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-longhorn-20211001182016686900000001"
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github.github_repository.example will be updated in-place
  ~ resource "github_repository" "example" {
      ~ description            = "My awesome terraform example f05a3592036e31e17f9f438334fd650a" -> (known after apply)
        id                     = "terraform-example"
        name                   = "terraform-example"
        # (24 unchanged attributes hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-etcd-20211001182016688800000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211001182016686900000001" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211001182016688800000003" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.prometheus.helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = true
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "prometheus-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "19.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>